Repository: 84000/data-translation-memory
Catalog: toh562-v3.tmx
Source language: bo
Languages: en

source: །གནོད་སྦྱིན་དག་གི་བདག་པོ་ཡང་། །མི་རྣམས་ལ་ནི་བདེ་ལེགས་བྱེད། །སྱཱད་ཡ་ཐེ་དན། བ་ཀ་ཧུ་མུ་ལེ། ཧ་ཤི་ཎ་ཤ་ཤི་ཎ། བ་ན་མུ་ཧ་ལེ་
en: The lord of yakṣas Ensures people’s well-being.”

source: ས་མུ་ཧཱ་ལེ། ཨུ་དུ་ཧཱ་ལེ། ས་མ་ཧཱ་ལེ། པྲ་ཤ་མ་མཱི། རཱཀྵ་ས། ཨ་མ་ནུ་ཥྱཱ། བཱ་རེ་མི། ཡཀྵ་ནི། བཱ་རཱ་མི་པྲེ་ཏ་མ་བྷི་ཐཻ། དུ་མ་ནུ་ཥྱཱ། མ་ས་པ་ཏ་ཧ་དྷ་མུར་ནན། སུ་ཏི་ཥྱ་ཏི། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་བུ། །མི་ལ་ཞོན་པ་སྡེར་བཅས་པས། །འདི་སྨྲས་ནས་ནི་ཚུབ་མ་ལངས། །དེ་བཞིན་རི་ཡང་གཡོས་པར་གྱུར།
en: Syād yathedam vakahumule haśiṇa śaśiṇa vanamuhale samuhāle uduhāle samahāle praśamamī rākṣasa amanuṣyā vāremi yakṣaṇi vārāmi pretamabhithai dumanuṣyā masapata hadhamuranan sutiṣyati When this was spoken by the great king Vaiśravaṇa, Borne on a man and accompanied by his army, A great storm arose, And the mountains shook. “

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་བུའི། །རིན་ཆེན་ཤིང་རྟ་བཅས་པ་ན། །ལྷ་དང་མི་ཡི་སྒྲ་སྐད་གྲག །
en: When the great king Vaiśravaṇa Stands in his jewel chariot, The voices of gods and humans resound.

source: རྒྱལ་པོ་ཆེན་པོ་འཆི་བ་ན། །དངོས་པོ་རྣམས་ཀྱང་འབར་བར་འགྱུར།
en: When the Great King arrives, Everything catches ablaze. “

source: །སྲིན་པོ་འདོད་དགུར་བསྒྱུར་བའི་གཟུགས། །དེ་ཡི་མདུན་ན་རྒྱུག་པར་བགྱིད། །མི་མ་ཡིན་པའི་གཟུགས་རྣམས་ཀྱིས། །འཇིགས་ཤིང་སྐྲག་པ་བསྐྱེད་པར་བགྱིད།
en: Rākṣasas, who shapeshift as they please, Are made to run before him, Their inhuman forms Provoking fear and dread. “

source: །ཆེ་ཞིང་གཏུམ་ལ་མི་བཟད་པ། །དྲག་ཅིང་མཐོང་ན་མི་སྡུག་ལ།
en: Huge and unbearably fierce, They are aggressive and hideous to behold.

source: །སྤུ་ཡང་རིང་ཞིང་སེན་མོ་རིང་། །ལག་ན་རལ་གྲི་ཐོ་བ་ཐོགས།
en: They have long body hair and long nails, And they hold swords and hammers in their hands. “

source: །སོ་ནི་ཟངས་ཅན་འཇིགས་པར་བགྱིད།
en: Their copper-colored teeth provoke fear.

source: །སྣ་ཆེ་རྔ་མོ་སྟག་གི་འདྲ།
en: They have large snouts, like a camel or tiger.

source: །དྲག་ཅིང་ལག་པ་ཁྲག་དམར་བ།
en: Aggressive, their hands are red with blood.

source: །ཡན་ལག་མ་ཚང་ཕྱེད་ཚལ་ལུས།
en: Their limbs are incomplete and their bodies half formed. “

source: །མིག་སེར་ལུས་ཀྱང་ཤིན་ཏུ་སེར།
en: Their eyes are yellow and their bodies bright yellow.

source: །དྲི་མ་ཅན་ལ་ལུས་སྐེམ་པ། །སྐྲ་བརྫེས་ལྕགས་ཀྱི་མཆུ་ཅན་ལ།
en: They are filthy and have wizened bodies, Lips of iron, and hair that flows upward.

source: །མཚོན་ཆ་ཚབས་ཆེར་འདེབས་པར་བགྱིད།
en: They strike with dangerous weapons. “

source: །རྣ་བ་གཞུ་རྣ་གསུས་པོ་ཆེ། །སྦྲུལ་གྱི་གཟུགས་ཅན་བེའུ་གཟུགས།
en: They have ears like bows and bloated stomachs, And they take forms like those of snakes or calves.

source: །ཕག་གི་གཟུགས་ཅན་ལྟོ་བོ་ཆེ། །མགོ་བོ་ཆེ་ལ་ལག་རིང་བ། །རྣ་འཕྱང་བ་ལ་ནུ་མ་འཕྱང་། །དེ་འདྲའི་གནོད་སྦྱིན་མང་པོ་ཡི།
en: They have the bodies of large-bellied pigs, Big heads, long arms, And ears and breasts that dangle. “

source: །གཡོག་འཁོར་དག་གིས་ཡོངས་སུ་བསྐོར། །གནོད་སྦྱིན་བྱེ་བ་ཕྲག་སྟོང་རྣམས། །དེ་དག་མ་ནི་ལིམ་ལོག་ཅན།
en: I am surrounded by a host Of many such yakṣas— A trillion yakṣas, Each ungrateful to their mother.

source: །གཡོག་འཁོར་དེ་དག་ལྷན་ཅིག་ཏུ། །བདག་ནི་ཕྱག་འཚལ་སླད་དུ་མཆི།
en: I have come to pay homage Together with this host.

source: །གཽ་ཏམ་དཔའ་བོ་ཁྱོད་ལ་ནི། །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས།
en: Heroic Gautama, we have come, Paying devout respect to you. “

source: །དྲག་ཅིང་རྒོད་ལ་གཏུམ་པ་དང་། །མགོ་བོ་ཆེ་ལ་སྐྲ་རིང་བ། །མི་རྣམས་དང་ནི་རི་དགས་དང་། །བྱ་རྣམས་གཟི་བྱིན་འཕྲོག་པར་བགྱིད།
en: Ferocious in their aggression and wildness, With large heads and long hair, They rob humans, beasts, And birds of their vitality. “

source: །མེ་འབར་ཟ་དང་མང་དུ་ཟ།
en: They eat blazing fire and so much more.

source: །མིག་གཅིག་པ་དང་མིག་སེར་དང་། །སྣ་དང་རྣ་བ་བཅད་པ་དང་།
en: Some have one eye, others yellow eyes, And some have severed noses and ears.

source: །ཆད་པ་མང་པོས་བཅད་པ་དང་། །མགོ་མ་མཆིས་དང་མགོ་བཅད་དང་།
en: Wounded with many lacerations, They have no heads, or they have severed heads.

source: །ལུས་ཀྱང་སྒུར་ལ་གཉེར་མ་གདོང་། །མིག་ལ་མེ་འབར་རྐང་མེད་པ།
en: They have hunched bodies, wrinkled faces, Fire blazing in their eyes, and no feet.

source: །མི་རྣམས་འཇིགས་པར་བགྱིད་པ་སྟེ། །འཕེལ་ཀ་ཆེ་ལ་རྒོད་བག་ཅན། །དེ་བཞིན་འགྲོ་ཞིང་རྒྱུ་བར་བགྱིད།
en: Frightening to humans, Broad and completely wild, They roam and dart about accordingly. “

source: །དེ་འདྲའི་གནོད་སྦྱིན་མང་པོ་ཡི། །གཡོག་འཁོར་དག་གིས་ཡོངས་སུ་བསྐོར། །གནོད་སྦྱིན་བྱེ་བ་ཕྲག་སྟོང་རྣམས། །དེ་དག་མ་ནི་རྐུན་མ་ལགས།
en: I am surrounded by a host Of many such yakṣas— A trillion yakṣas, Each with a thief for a mother.

source: །གཡོག་འཁོར་དེ་དག་ལྷན་ཅིག་ཏུ། །བདག་ནི་ཕྱག་འཚལ་སླད་དུ་མཆིས།
en: I have come to pay homage Together with this host.

source: །བདག་ཅག་གི་ནི་གནས་རྣམས་ན། །ཤིང་རྟ་ཞེས་བགྱི་སྲིན་མོ་མཆིས།
en: A rākṣasī named Chariot Lives within our realms.

source: །དེ་ལ་བུ་ཕོ་སྟོབས་ལྡན་པ། །སྟོང་ཕྲག་བཅུ་ཡི་གྲངས་སྙེད་མཆིས། །དེ་དག་བདག་གི་གཡོག་ལགས་ཏེ། །དེ་དག་ཕྱག་འཚལ་སླད་དུ་མཆིས།
en: She has ten thousand mighty sons Who are my servants And have come to pay homage.

source: །གཽ་ཏམ་དཔའ་བོ་ཁྱོད་ལ་ནི། །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས། །བདག་ཅག་གི་ནི་གནས་རྣམས་ན།
en: Heroic Gautama, we have come, Paying devout respect to you. “

source: །མགྲིན་རིངས་ཞེས་བགྱི་སྲིན་མོ་མཆིས། །སྲིན་མོ་ཤིན་ཏུ་གནག་པ་དང་། །སྲིན་མོ་ནག་མོ་ཞེས་བགྱི་དང་། །སྲིན་མོ་རབ་གནག་རྣམས་མཆིས་ཏེ།
en: A rākṣasī named Long Neck Lives within our realms, As do one named Exceedingly Dark, One named Black Lady, And one named Pitch Dark.

source: །དེ་དག་གཽ་ཏམ་མཐུན་པར་བལྟ།
en: They pay respect to Gautama. “

source: །ས་ཡི་གནོད་སྦྱིན་བདག་ཉིད་ཆེ། །དེ་དག་ས་སྟེངས་གནས་པ་སྟེ། །གཡོག་འཁོར་དེ་དག་རྣམས་ཀྱིས་ནི།
en: Those great beings, yakṣas of the earth, Dwell on the surface of the earth.

source: །ཡོངས་སུ་བསྐོར་ཏེ་འདིར་མཆིས་ལགས།
en: Surrounded by this host, I have come here.

source: །དེ་དག་ཀུན་དང་ལྷན་ཅིག་ཏུ། །བདག་ནི་ཕྱག་འཚལ་སླད་དུ་མཆིས།
en: I have come to pay homage, Together with this host.

source: །བདག་གི་མདུན་ན་རྒྱུག་པ་ཡི། །ཡི་དགས་གནོད་སྦྱིན་སྲིན་པོ་རྣམས། །ལུས་ཆེན་ཤུགས་ཀྱང་དྲག་པོ་སྟེ།
en: The pretas, yakṣas, and rākṣasas Who run before me Have huge bodies, strong and fierce.

source: །སོ་ཡང་ཆེ་ལ་ལྟོ་བོ་ཆེ།
en: Their teeth are large, their stomachs bloated.

source: །རྣ་འཕྱང་འཇིགས་པ་ཆེན་པོ་སྟེ།
en: Śūrpakas hang On their horrific, pendulous ears. “

source: །སློ་མ་རྣ་ལ་རབ་ཏུ་འཕྱང་། །ཡན་ལག་དྲུག་པ་སོ་བརྟན་པ། །གུར་གུམ་མདོག་ཅན་ཐོ་བ་འདྲ། །སོ་ཡང་རྩུབ་ཅིང་རྣོ་བ་དང་།
en: They have a six limbs and hard teeth That are like saffron-colored hammers.

source: །མདུང་ཐུང་གསལ་ཞིང་འཇིགས་པར་བགྱིད།
en: Their teeth are also jagged and sharp, Spear-like and terrifying. “

source: །གླང་ཆེན་མགོ་དང་བུམ་སྣ་ཅན། །མགོ་བོ་སྟག་དང་སེང་གེ་འདྲ། །ལྕགས་ཀྱི་སོ་ཅན་ལྕགས་ཀྱི་སྐྲ།
en: They have elephant heads, gourd-like snouts, Heads like tigers and lions, Iron teeth, and iron hair.

source: །གདོན་རྣམས་རྣམ་པར་སྐྲག་བགྱིད་པ། །ལག་ན་ལྕགས་ཀྱི་གཏུན་བུ་ཐོགས། །ལག་ན་ལྕགས་ཀྱི་ཐོ་བ་ཐོགས།
en: They instill fear in grahas “They carry iron cudgels And iron hammers in their hands.

source: །སོ་རྣོན་ལག་པ་རིང་བ་སྟེ། །འཇིགས་པའི་གཟུགས་ཅན་ལྕགས་ཀྱི་མཆུ།
en: With sharp teeth and long arms, They take terrifying forms.

source: །མགོ་བོ་ཆེ་ལ་སྐྲ་གཡེངས་པ།
en: They have lips of iron, large heads, and disheveled hair.

source: །གནག་ཅིང་མིག་སེར་སྣ་ཞོམ་པ།
en: They are black with yellow eyes and crooked noses.

source: །བུམ་པའི་མགྲིན་དང་མིག་དམར་དང་། །མིག་གཅིག་པ་དང་ལྟོ་བོ་ཆེ།
en: They have gourd-like necks and red eyes, Or one eye, and bloated bellies.

source: །མཆུ་འཕྱངས་པ་དང་ལག་གཅིག་པ། །རྐང་གཅིག་པ་དང་རྐང་གཉིས་པ།
en: Their lips dangle, and some have only one hand, Some one foot, and some two feet.

source: །ཁ་མེད་ཁ་གཉིས་དྲག་པོ་སྟེ།
en: Some have no mouth, or two mouths.

source: །མི་རྣམས་རབ་ཏུ་འཇིགས་པར་བགྱིད།
en: They are ferocious And terrifying to humans. “

source: །ལག་ན་ཁར་བ་དབྱུག་པ་ཐོགས། །མདུང་རྩེ་གསུམ་པ་སྐྲག་ཅིང་འཇིགས།
en: They frighten and terrify With clubs, sticks, and tridents in hand.

source: །སྐྲག་ཅིང་འཇིགས་པར་བྱེད་པ་སྟེ། །གདོན་རྣམས་རྣམ་པར་སྐྲག་བགྱིད་པ། །སྐྲག་པར་བགྱིད་ཅིང་སྨྲ་བར་བགྱིད།
en: Frightening and terrifying, They strike fear in the grahas, Causing them to cry out in fear.

source: །སེམས་ཀྱང་འཁྲུལ་བར་བགྱིད་པ་སྟེ། །སྨྱོ་བར་བགྱིད་ཅིང་རྨོངས་པར་བགྱིད། །དེ་ནས་གཟི་བྱིན་འཕྲོག་པར་བགྱིད།
en: They disorient their minds, Cause madness and stupefaction, And then steal their vitality. “

source: །དེ་དག་འཇིག་རྟེན་འཇིགས་པ་སྟེ། །སྟོབས་པོ་ཆེ་ལ་བསྟེན་པར་དཀའ།
en: It is difficult for those who terrify the world To rely on the Great Powerful One.

source: །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་པོ། །རྒྱལ་པོ་ཆེན་པོའི་མདུན་ན་རྒྱུག །
en: Sixty-four thousand of them Run before the Great King. “

source: དེ་འདྲའི་གནོད་སྦྱིན་མང་པོ་ཡི། །གཡོག་འཁོར་དག་གིས་ཡོངས་སུ་བསྐོར། །གནོད་སྦྱིན་བྱེ་བ་ཕྲག་སྟོང་རྣམས། །དེ་དག་ཕྱག་འཚལ་སླད་དུ་མཆིས།
en: A trillion yakṣas Surrounded by a host Of many such yakṣas Have come to pay homage.

source: །གཽ་ཏམ་དཔའ་བོ་ཁྱོད་ལ་ནི། །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས། །ས་ག་ལྔས་རྩེན་ཟླ་བ་དང་། །སེང་གེ་སྡེ་དང་རབ་གནོན་དང་། །མ་ལ་སྦྱིན་བརྩོན་དྲག་པོ་དང་། །གང་པོ་དང་ནི་ནོར་འཛིན་དང་། །ཙནྡན་དང་ནི་འདོད་མཆོག་དང་། །སྣ་ཚོགས་སྡེ་དང་གཏོར་མ་ལེན། །ཡིད་བཞིན་རབ་འབྱོར་བཞིན་བཟང་དང་།
en: Heroic Gautama, we have come, Paying devout respect to you. “

source: །འདམ་བུ་ཅན་དང་ཤིན་ཏུ་རྒྱལ། །འདོད་པ་ཐམས་ཅད་འབྱོར་པ་དང་། །དབང་པོ་རྒྱལ་བ་ཁྱུ་མཆོག་དང་། །ནོར་བུ་བཟང་སྲས་རྫོགས་བཟང་དང་། །འདམ་བུ་ས་མཆོག་འདམ་བུ་དགའ། །ཁབ་ཀྱི་སྤུ་ཅན་རིང་བཟང་དང་། །ལག་མཆོག་སྐྱེ་དགུའི་བདག་པོ་དང་། །འདམ་བུའི་རྒྱུད་དང་མདུང་རིང་དང་། །རིག་པ་སྟོབས་ཅན་ནོར་བུ་དང་། །འཇོག་པོ་ནག་པོ་ཆེན་པོ་དང་།
en: There are Viśākha, Pāñcika, Candra, Lion Army, Oppressor, Mother’s Gift, Fierce Diligence, Pūrṇa, Wealth Bearer, Candana, Supreme Desire, Motley Army, Taker of Oblations, Wish-Fulfilling Fortune, Attractive, Reed Holder, Exceedingly Victorious, Rich with All Wishes, Lord Conqueror, Pack Leader, Son of Fine Gem, Sublimely Perfect, Supreme Reed of the Earth, Delightful Reed, Sūciloman, Sublimely Long, Supreme Hand, Prajāpati, Reed Thread, Long Spear, Powerful Knowledge, Gem, Takṣaka, Mahākāla, Kambala, Mule, And Airāvaṇa, the king of nāgas. “

source: །ལ་བ་ཅན་དང་དྲེའུ་དང་གཉིས། །ཀླུ་ཡི་རྒྱལ་པོ་ས་སྲུང་བུ། །ཡན་ལག་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེ། །ནམ་མཁའ་ལྡིང་ནི་ཤུགས་ཆེན་ལྡན། །འདབ་ཆགས་ཀུན་གྱི་མཆོག་གྱུར་པ།
en: The powerful garuḍas, With massive wings and miraculous powers, Are supreme among all winged beings.

source: །བྱ་ཡི་གཟུགས་ཀྱིས་མཆི་བགྱིད་ཅིང་། །རྒྱ་མཚོ་ཀུན་ཏུ་འཁྲུག་པར་བགྱིད།
en: Traveling in the form of birds, They cause all the oceans to roil. “

source: །ལྷ་དང་ལྷ་མིན་དྲི་ཟ་རྣམས། །འཇིགས་པར་བགྱིད་དང་དགེ་བའང་རུང་། །མ་དད་པ་དང་དད་པ་རྣམས། །དེ་དག་ཐམས་ཅད་འདིར་མཆིས་ཏེ།
en: Gods, asuras, and gandharvas, Whether frightening or virtuous, With or without trust, Have all come here.

source: །འཕྲོག་མ་ཞེས་བགྱི་གནོད་སྦྱིན་མོ། །འཇིགས་པར་བགྱིད་པ་སྟོབས་ཆེན་མོ། །དེ་ཡི་བུ་ནི་ལྔ་བརྒྱ་རྣམས། །འཇིགས་བགྱིད་གནོད་སྦྱིན་མཐུ་རྩལ་ཅན། །བདག་ཉིད་ཀྱི་ནི་གཡོག་ལགས་ཏེ།
en: The yakṣiṇī named Hārītī, Terrifying and powerful, And her five hundred sons, Terrifying and mighty yakṣas, Are all my servants.

source: །དེ་དག་ཕྱག་འཚལ་སླད་དུ་མཆིས།
en: They have come to pay homage.

source: །གཽ་ཏམ་དཔའ་བོ་ཁྱོད་ལ་ནི། །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས། །མ་ག་དྷཱ་ན་ཐམས་ཅད་མཐོང་། །ཀ་ཤི་ཀ་ནི་པདྨ་འཆང་། །ཡངས་པ་ཅན་ན་རྒྱལ་མཆོག་གནས། །གྱད་ཡུལ་ན་ནི་གྲགས་འཛིན་གནས། །རྒྱལ་པོའི་ཁབ་ན་ཀུ་བེ་ར། །སེར་སྐྱའི་གནས་ན་དྲག་པོ་སྟེ།
en: Heroic Gautama, we have come, Paying devout respect to you. “

source: །ཏ་མ་ལ་ན་འབྱོར་པ་གནས། །མི་ཏི་ལ་ན་ཀུན་ཏུ་རྒྱལ། །མ་མོ་ཆེན་མོ་འདི་བརྒྱད་ནི། །གནོད་སྦྱིན་རྣམས་ཀྱི་སྡེ་དཔོན་མཆོག །རྫུ་འཕྲུལ་ཆེན་པོ་སྐལ་བ་ཆེ། །སྟོབས་ཆེན་དེ་དག་ཐམས་ཅད་ནི།
en: All Seeing in Magadha, Lotus Bearer in Kāśi, Supreme Victor, who dwells in Vaiśālī, Yaśodharā who dwells in Malla, Kumbhīrā in Rājagṛha, Fierce in Kapilavastu, Wealth, who dwells in Tamala, And Always Victorious in Mithilā— These eight great mātṛkās Are the highest generals of the yakṣas; They possess great miraculous power, fortune, and strength.

source: །ཡིད་དགེ་དད་པའི་སེམས་དང་ལྡན། །རྫོགས་སངས་རྒྱས་ལ་སྐྱབས་མཆིས་པས། །དེ་དག་དང་ནི་འདུས་ནས་ཀྱང་།
en: They have all come with virtuous and devout intentions To take refuge in the perfect Buddha.”

source: །རྒྱལ་པོ་ཆེན་པོ་སྟོབས་ཆེན་གྱིས། །ཡང་དག་རྫོགས་སངས་རྒྱས་བསྟན་ལ། །མི་རྣམས་ལ་ནི་སྙིང་བརྩེའི་སླད། །གནོད་སྦྱིན་འབྱུང་པོ་ཡི་དགས་དང་། །སྡང་བའི་གདོན་རྣམས་བཟློག་པ་དང་། །མི་མ་ཡིན་རྣམས་བཟློག་པ་ཡི། །བསྲུང་བ་འདི་ནི་ལེགས་པར་བགྱིས།
en: Gathered together with them, The powerful Great King, In service to the perfect Buddha’s teaching, And out of love for humans, Properly enacted this protection, Which turns away all yakṣas, bhūtas, pretas, Hostile grahas, and nonhumans.

source: །དེ་ནས་རྒྱལ་པོ་རྣམ་ཐོས་བུ། །ཐལ་སྦྱར་འདུག་སྟེ་སྨྲས་པ་ནི། །ཁོན་དང་འཇིགས་པ་ཀུན་འདས་པ། །རྣམ་གྲོལ་ཟག་པ་མི་མངའ་བ།
en: The king Vaiśravaṇa Then joined his palms and said: “You have transcended all resentment and fear, And you are fully liberated and free of defilements.

source: །ཁྱོད་ལ་ལྷ་དང་གྲུབ་པ་དང་། །བྲམ་ཟེ་ཐམས་ཅད་ཕྱག་འཚལ་ཏེ།
en: All gods, siddhas, And brahmins pay homage to you.

source: །གནོད་སྦྱིན་བྱེ་བ་དྲུག་ཁྲི་དང་། །བཞི་སྟོང་དག་ཀྱང་ལྷགས་ནས་ནི། །ཁོ་ར་ཁོར་ཡུག་ཡོངས་བསྐོར་ནས། །ཐལ་མོ་སྦྱར་ཏེ་འཁོད་གྱུར་ལགས།
en: Six hundred and forty million yakṣas have also come; Circling from all sides, They amass with their palms joined. “

source: །བདག་ནི་རྒྱལ་པོ་རྣམ་ཐོས་བུ། །བྱང་ཕྱོགས་སྐྱོང་བར་བགྱིད་པ་སྟེ། །འཇིག་རྟེན་མགོན་པོའི་ཉེ་འཁོར་དུ། །གནོད་སྦྱིན་རྒྱུ་སྐར་སྨྱོ་བྱེད་དང་། །བརྗེད་བྱེད་དང་ནི་མི་འམ་ཅི།
en: I am King Vaiśravaṇa, The guardian of the north.

source: །སྐེམ་བྱེད་དང་ནི་རིམས་དྲག་དང་། །དེ་བཞིན་རིམས་ནད་ཞག་བཞི་པ། །དེ་དག་བདག་གིས་བཟློག་པར་བགྱི། །སྱཱད་ཡ་ཐེ་དན། ཨུ་ཧ་ཧཾ། ཨུ་ཧ་ཧཾ། མ་ཧཱ་ཧཾ། ཨུ་ཧ་མ་ཧཱ་ཧཾ། ས་ལ་མུ་ཛི། ཨི་ལཱི་མི་ལི། ཨི་ལཱི་མི་ལི། ཀི་ལཱི་མི་ལི། ཙི་རི་ཊི། ཨུ་བྷི་ཨུ་ཏུ་བྷི། པི་ཏི་ལི་ཡེ།
en: I will repel all yakṣas, nakṣatras, unmādas, Apasmāras, kinnaras, skandas, And intense fevers up through four-day fevers In the vicinity of the world protector.”

source: མ་ཊ་མ་ལི། མ་ནནྡ་ཡེ་སྭཱ་ཧཱ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལུས་ངན་ལྕང་ལོ་ཅན་གྱི་བདག་པོ་ཕྱོགས་སྐྱོང་བར་གྱུར་ཅིག །གནོད་སྦྱིན་དང་། རྒྱུ་སྐར་དང་། སྨྱོ་བྱེད་དང་། བརྗེད་བྱེད་དང་། མི་འམ་ཅི་དང་།
en: Syād yathedam uhaham uhahaṃ mahāham uhamahāhaṃ salamuji ilīmili ilīmili kilīmili ciriṭi ubhi utubhi pitiliye maṭamali manandaye svāhā May the great king Vaiśravaṇa, Kubera, lord of Aḍakavatī, guard this direction.

source: གྱེན་དུ་རྒྱུ་དང་། རྒྱུ་བ་དང་། འདུན་པ་དང་། ངན་བྱེད་དང་། གཟི་བྱིན་འཕྲོག་པ་རྣམས་བཟློག་པར་གྱུར་ཅིག །
en: May he repel yakṣas, nakṣatras, unmādas, apasmāras, kinnaras, upward movers, wandering beings, covetous ones, evildoers, and those who steal vitality.

source: ལྷའི་ནང་ན་ལྷའི་རྒྱལ་པོ་ནོར་ལྷའི་བུ་ཞེས་བགྱི་བ་མཆིས་ཏེ།
en: Vāsava, the king of all gods, has come.

source: དེ་ལ་བདག་ཕྱག་འཚལ་ལོ།
en: I pay homage to him.

source: །དེ་ཡང་བཅོམ་ལྡན་འདས་ཉིད་ལ་ཕྱག་འཚལ་ཏེ། རྫོགས་པའི་སངས་རྒྱས་དཔའ་བོ་སྟེ། །ཀུན་མཁྱེན་ཀུན་གཟིགས་ཁྱོད་ལ་འདུད།
en: He, too, pays homage to the Blessed One: “Heroic perfect Buddha, All seeing and all knowing—I bow to you.

source: །ཡང་དག་དཔའ་བོ་ཁྱོད་ལ་འདུད།
en: I bow to you, perfect hero.

source: །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས།
en: I have come, paying devout respect.”

source: །དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་། །ཐལ་སྦྱར་འདུག་སྟེ་སྨྲས་པ་ནི། །ཆོས་ཀྱི་རྒྱལ་པོ་འོད་མཛད་པ། །སངས་རྒྱས་དཔལ་ལ་བདག་ཕྱག་འཚལ།
en: Then the king Dhṛtarāṣṭra, Joined his palms and said: “I pay homage to the glorious Buddha, The illuminating king of Dharma.

source: །གཽ་ཏམ་ཁྱོད་ཀྱིས་གང་མཁྱེན་པ། །དེ་ནི་ལྷ་རྣམས་མ་འཚལ་ཏོ།
en: That which you know, Gautama, The gods have not grasped. “

source: །སྲིན་པོ་མཐོང་ན་རབ་འཇིགས་པ། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་རྣམས། །ཁོ་ར་ཁོར་ཡུག་ཡོངས་བསྐོར་ནས། །ཐལ་མོ་སྦྱར་ཏེ་འཁོད་གྱུར་ལགས།
en: Sixty-four thousand rākṣasas, Terrifying to behold, Circle from all sides, Amassing with their palms joined. “

source: །བདག་ནི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་། །ཤར་ཕྱོགས་སྐྱོང་བར་བགྱིད་པ་སྟེ།
en: I am King Dhṛtarāṣṭra, The guardian of the east.

source: །འཇིག་རྟེན་མགོན་པོའི་ཉེ་འཁོར་དུ། །སྲིན་པོ་རྣམས་དང་ཤ་ཟ་དང་། །དྲི་ཟ་དང་ནི་རླུང་ལྷ་རྣམས། །དེ་དག་བདག་གིས་བཟློག་པར་བགྱི། །སྱཱད་ཡ་ཐེ་དན། ཨི་ཏི་མི་ཊཱི། ཁུ་ར་ཊེ། ཕུ་ར་ཊེ། མ་ཏི་བི་མ་ཊི། ཨུ་མ་ཎི་ཨཀྐེ། མཀྐེ། ནཀྐེ། ཨ་ཊུ་མི།
en: I will repel all rākṣasas, piśācas, Gandharvas, and marutas In the vicinity of the world protector.”

source: བ་ཊུ་མི། མ་བྷེ། ཨེ་རི་ཊི། པི་རི་ཊི་སྭཱ་ཧཱ། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ཕྱོགས་སྐྱོང་བར་གྱུར་ཅིག །སྲིན་པོ་དང་།
en: Syād yathedam atimiṭī khuraṭe phuraṭe mati vimaṭi umaņi akke makke nakke aṭumi vaṭumi mabhe eriṭi piriti svāhā May the great king Dhṛtarāṣṭra guard this direction.

source: ཡི་དགས་དང་། དྲི་ཟ་དང་། རླུང་ལྷ་དང་། མི་འམ་ཅི་དང་། གཟི་བྱིན་འཕྲོག་པ་རྣམས་བཟློག་པར་གྱུར་ཅིག །
en: May he repel all rākṣasas, pretas, gandharvas, marutas, kinnaras, and those who steal vitality.

source: །དེ་ནས་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ། །ཐལ་སྦྱར་འདུག་སྟེ་སྨྲས་པ་ནི། །འཇིག་རྟེན་མགོན་པོ་སྐྱབས་མཛད་པ། །འཇིག་རྟེན་ཀུན་ལ་ཕན་པ་མཛད། །གཽ་ཏམ་དཔའ་བོ་ཁྱོད་ལ་ནི། །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས།
en: Then the king Virūḍhaka Joined his palms and said: “Protector and refuge of the world, Benefactor of all worlds, Heroic Gautama, I have come, Paying devout respect to you. “

source: །གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་རྣམས། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་རྣམས། །ཁོ་ར་ཁོར་ཡུག་ཡོངས་བསྐོར་ནས། །ཐལ་མོ་སྦྱར་ཏེ་འཁོད་གྱུར་ལགས།
en: Sixty-four thousand Kumbhāṇḍas, pretas, and pūtanas Circle from all sides, Amassing with their palms joined. “

source: །བདག་ནི་རྒྱལ་པོ་འཕགས་སྐྱེས་པོ། །ལྷོ་ཕྱོགས་སྐྱོང་བར་བགྱིད་པ་སྟེ། །འཇིག་རྟེན་མགོན་པོའི་ཉེ་འཁོར་དུ།
en: I am King Virūḍhaka, The guardian of the south.

source: །འབྱུང་པོ་རྒྱུ་བ་གཟི་བྱིན་འཕྲོག །གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་རྣམས། །དེ་དག་བདག་གིས་བཟློག་པར་བགྱི། །སྱཱད་ཡ་ཐེ་དན། ཨ་ལེ། ཨི་ལེ་ལེ། ཀི་ལེ་ཀི་ལེ་ལེ། ཀུ་པ་ཀུ་པ་ས། སི་ལེ་སི་ལེ་ལེ། སི་ལི་ལི་ལི། ལི་ལི་ལི་ལི་ལི། ཧི་ཧི་སི་ལེ། མ་ཏི་སུ་མ་ཏི།
en: I will repel all bhūtas, wandering beings, Stealers of vitality, kumbhāṇḍas, pretas, and pūtanas In the vicinity of the world protector.”

source: སུ་སུ་མ་ཏི། སུ་སུ་སུ་སུ། སུ་སུ་མ་ཏི། ཧི་ལི་ཥ་ཧི་ལི་ཥ་སྭཱ་ཧཱ། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ཕྱོགས་སྐྱོང་བར་གྱུར་ཅིག །གྲུལ་བུམ་དང་།
en: Syād yathedam ale ilele kile kilele kupa kupasa sile silele sililili lilililili hihisile mati samuti susumati susususu susumati hiliṣa hiliṣa svāhā May the great king Virūḍhaka guard this direction.

source: ཡི་དགས་དང་། སྲུལ་པོ་དང་། འབྱུང་པོ་དང་། རྒྱུ་བ་དང་། གཟི་བྱིན་འཕྲོག་པ་རྣམས་བཟློག་པར་གྱུར་ཅིག །
en: May he repel all kumbhāṇḍas, pretas, pūtanas, bhūtas, wandering beings, and stealers of vitality.

source: །དེ་ནས་རྒྱལ་པོ་མིག་མི་བཟང་། །ཐལ་སྦྱར་འདུག་སྟེ་སྨྲས་པ་ནི། །མུན་པར་གྱུར་པའི་འཇིག་རྟེན་ལ། །བཅོམ་ལྡན་ལམ་རྣམས་སྟོན་མཛད་པ།
en: Then the king Virūpākṣa Joined his palms and said: “In this world of darkness, You show the paths of the blessed ones.

source: །འཇིག་རྟེན་དག་ན་ཉི་ཟླ་འདྲ། །རིན་ཆེན་སྙིང་པོ་སྟོབས་པོ་ཆེ།
en: You are like the sun and moon in all worlds, Powerful like the heart of a jewel.

source: །ཀླུ་དང་མཁའ་ལྡིང་གསང་བ་པ། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་རྣམས། །ཁོ་ར་ཁོར་ཡུག་ཡོངས་བསྐོར་ནས། །ཐལ་མོ་སྦྱར་ཏེ་འཁོད་གྱུར་ལགས།
en: Sixty-four thousand nāgas, garuḍas, and guhyakas Circle from all sides, Amassing with their palms joined. “

source: །བདག་ནི་རྒྱལ་པོ་མིག་མི་བཟང་། །ནུབ་ཕྱོགས་སྐྱོང་བར་བགྱིད་པ་སྟེ། །འཇིག་རྟེན་མགོན་པོའི་ཉེ་འཁོར་དུ། །ཀླུ་དང་མཁའ་ལྡིང་གསང་བ་པ།
en: I am King Virūpākṣa, The guardian of the west.

source: །ལྷ་མིན་དབང་པོ་སྟོབས་པོ་ཆེ། །དེ་དག་བདག་གིས་བཟློག་པར་བགྱི། །སྱཱད་ཡ་ཐེ་དན། དགེ་དགེ། སུ་བ་ཏི་ཡེ། པ་ཊེ། ཨཊ། ཀ་མཊྚེ། བི་མ་བི་ད་མ། བི་ད་ད་མ། བྷི་ད་ད་མ་ནི། ཨ་བྷི་ན་མེ།
en: I will repel all nāgas, garuḍas, guhyakas, And the powerful asura lords In the vicinity of the world protector.”

source: གཙྪ་བྷུ་ཏེ། ད་ལ་ཕི་ཡེ། བ་ར་སུརྟྲ་ཙི་ཙི་ལེ། ཙི་ལི་ལི་ལི་ལི་ལི་ལི་སྭཱ་ཧཱ། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ཕྱོགས་སྐྱོང་བར་གྱུར་ཅིག །
en: Syād yathedam dage dage suvatiye paṭe aṭa kamaṭṭe vima vidama vidadama bhidadamani abhiname gaccha bhūte dala phiye varasura rātra cicile cilililililili svāhā May the great king Virūpākṣa guard this direction.

source: ཀླུ་དང་། ནམ་མཁའ་ལྡིང་དང་། གསང་བ་པ་དང་། ལྷ་མ་ཡིན་དང་། གཟི་བྱིན་འཕྲོག་པ་རྣམས་བཟློག་པར་གྱུར་ཅིག །
en: May he repel all nāgas, garuḍas, guhyakas, asuras, and stealers of vitality.

source: །ཆོས་བཞིན་མཐུན་པར་བལྟ་ཞིང་མཆིས། །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་ནས།
en: The Four Great Kings then draped their upper robes over one shoulder and knelt on their right knee.

source: བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་ཕྱག་འཚལ་ཞིང་གྲོས་མཐུན་པ་དང་། ཚིག་མཐུན་པ་དང་། སྐད་མཐུན་པར་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བསྲུང་བ་སྟེ་འཁོར་བཞི་པོ་རྣམས་ལ་ཡོངས་སུ་ཁྱབ་པ་ལགས་སོ། །གནོད་སྦྱིན་དང་།
en: Bowing solely to the Blessed One with palms joined, they said the following, unified in sense, phrasing, and tone: “Venerable Blessed One, this Great Sūtra of Cool Grove, the protection of the Four Great Kings, covers all four communities.

source: སྲིན་པོ་ནས་གནོད་པ་བགྱིད་པའི་བར་དུ་བཟློག་པར་བགྱི་བ་དང་།
en: It repels everything from yakṣas and rākṣasas all the way up to harm doers.

source: འཁོར་བཞི་པོ་རྣམས་ལ་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦེད་པ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་དང་། བདེ་བར་གནས་པར་བགྱིད་པ་ལགས་སོ།
en: It protects, guards, and shields the four communities, ensuring their happiness and well-being so they can dwell at ease.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་བཟུང་ཟིན་ནོ།
en: The Blessed One replied to the Four Great Kings, “Great Kings, you have upheld the great king of vidyā-mantras.

source: །བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་ངས་ཡོངས་སུ་བཟུང་ཟིན་ནོ།
en: I have accepted The Great Sūtra of Cool Grove.

source: །ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དག་གཞན་ཡང་ངས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་ལ་རྗེས་སུ་ཡི་རང་བའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་བརྗོད་ཀྱིས།
en: Great Kings, to rejoice in The Great Sūtra of Cool Grove, I will, moreover, utter the great king of vidyā-mantras.

source: དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: Listen carefully and retain it. I will disclose it now.” “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ། །ཞེས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཉན་ཏོ།
en: May the Blessed One please do so,” replied the Four Great Kings, and they listened to what the Blessed One said.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་རིན་པོ་ཆེ་གཡས་པས་ན་བཟའ་ཆོས་གོས་ཕྱེ་ནས་འབྱུང་པོའི་ཚོགས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ངས་འདི་བསྟན་པར་བྱའོ།
en: The Blessed One then opened his robe with his precious right hand and said to the assemblies of bhūtas, “I will reveal it.

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་དབྱེ་བར་བྱའོ།
en: I will disclose it to the great king Vaiśravaṇa.

source: །ཐམས་ཅད་ལ་གོ་བར་བྱའོ།
en: I will make it comprehensible to everyone.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་རིག་སྔགས་འདི་བཀའ་སྩལ་ཏོ། །སྱཱད་ཡ་ཐེ་དན། ཧི་ལཱི་ཧི་ལཱི། བྷི་སི་ནི། བཀྐེ །
en: The blessed, completely perfect Buddha then spoke the following vidyā-mantra: Syād yathedam hilī hilī bhisini vakke aharaye tamati tamati tila vakke valītake daritina dadhinada phuṭyi phuphuṭyi guṭyi guguṭyi hijakānti nāmā kāntī svāhā The whole earth shook when the Blessed One uttered this great king of vidyā-mantras.

source: ཨ་ཧ་ར་ཡེ། ཏ་མ་ཏི། ཏ་མ་ཏི། ཏི་ལ་བཀྐེ། བ་ལཱི་ཏ་ཀེ། ད་རི་ཏི་ན། ད་དྷི་ན་ད། ཕུ་ཊྱི་ཕུ་ཕུ་ཊྱི། གུ་ཊྱི་གུ་གུ་ཊྱི།
en: All the bhūtas trembled and let out loud gasps of “Alas!

source: ཧི་ཙ་ཀཱནྟི། ནཱ་མཱ།
en: Oh no!

source: ཀཱན་ཏཱི་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱིས་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་འདི་བཀའ་སྩལ་པ་ན་ས་འདི་ཀུན་ཏུ་གཡོས། འབྱུང་པོ་ཐམས་ཅད་རབ་ཏུ་འདར་ནས་ཀྱེ་མ་ཀྱེ་ཧུད་ཀྱེ་མ་སྡུག་བསྔལ་ལོ་ཞེས་སྒྲ་ཆེན་པོ་བྱུང་ངོ་།
en: What misery!”

source: །སྲིན་པོ་རྣམས་ཀྱིས་ཀྱང་འདི་སྐད་ཅེས་སྨྲས་ཏེ། འདི་ལྟར་ཡང་དག་རྫོགས་སངས་རྒྱས། །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་ནས། །འབྱུང་པོ་ཀུན་འཇིགས་ཉེན་པ་ཡི། །རིག་སྔགས་འདི་འདྲ་སྲུང་བར་མཛད།
en: The rākṣasas also said: “Thus does the completely perfect Buddha, Moved by compassion for all beings, Use such a vidyā-mantra To protect against the peril of all bhūtas.”
